{
    "paper_authors_list": [
        "Matsuo, Tadashi", 
        "Fukuhara, Hiroya", 
        "Shimada, Nobutaka"
    ], 
    "paper_comments": "6 pages, 17 figures, to be published in IROS 2017", 
    "paper_page_url": "https://arxiv.org/abs/1709.03754", 
    "paper_abstract": "The auto-encoder method is a type of dimensionality reduction method. A\nmapping from a vector to a descriptor that represents essential information can\nbe automatically generated from a set of vectors without any supervising\ninformation. However, an image and its spatially shifted version are encoded\ninto different descriptors by an existing ordinary auto-encoder because each\ndescriptor includes a spatial subpattern and its position. To generate a\ndescriptor representing a spatial subpattern in an image, we need to normalize\nits spatial position in the images prior to training an ordinary auto-encoder;\nhowever, such a normalization is generally difficult for images without obvious\nstandard positions. We propose a transform invariant auto-encoder and an\ninference model of transform parameters. By the proposed method, we can\nseparate an input into a transform invariant descriptor and transform\nparameters. The proposed method can be applied to various auto-encoders without\nrequiring any special modules or labeled training samples. By applying it to\nshift transforms, we can achieve a shift invariant auto-encoder that can\nextract a typical spatial subpattern independent of its relative position in a\nwindow. In addition, we can achieve a model that can infer shift parameters\nrequired to restore the input from the typical subpattern. As an example of the\nproposed method, we demonstrate that a descriptor generated by a shift\ninvariant auto-encoder can represent a typical spatial subpattern. In addition,\nwe demonstrate the imitation of a human hand by a robot hand as an example of a\nregression based on spatial subpatterns.", 
    "paper_subjects": null, 
    "paper_code": "1709.03754", 
    "paper_submission_date": "2017/09/12", 
    "paper_title": "Transform Invariant Auto-encoder"
}