{
    "paper_authors_list": [
        "Fu, Szu-Wei", 
        "Tsao, Yu", 
        "Lu, Xugang", 
        "Kawai, Hisashi"
    ], 
    "paper_comments": null, 
    "paper_page_url": "https://arxiv.org/abs/1709.03658", 
    "paper_abstract": "Speech enhancement model is used to map a noisy speech to a clean speech. In\nthe training stage, an objective function is often adopted to optimize the\nmodel parameters. However, in most studies, there is an inconsistency between\nthe model optimization criterion and the evaluation criterion on the enhanced\nspeech. For example, in measuring speech intelligibility, most of the\nevaluation metric is based on a short-time objective intelligibility (STOI)\nmeasure, while the frame based minimum mean square error (MMSE) between\nestimated and clean speech is widely used in optimizing the model. Due to the\ninconsistency, there is no guarantee that the trained model can provide optimal\nperformance in applications. In this study, we propose an end-to-end\nutterance-based speech enhancement framework using fully convolutional neural\nnetworks (FCN) to reduce the gap between the model optimization and evaluation\ncriterion (true targets). Because of the utterance-based optimization, temporal\ncorrelation information of long speech segments, or even at the entire\nutterance level, can be considered when perception-based objective functions\nare used for the direct optimization. As an example, we implement the proposed\nFCN enhancement framework to optimize the STOI measure. Experimental results\nshow that the STOI of test speech is better than conventional MMSE-optimized\nspeech due to the consistency between the training and evaluation target.\nMoreover, by integrating the STOI in model optimization, the performance of the\nautomatic speech recognition (ASR) system on the enhanced speech is also\nsubstantially improved compared to those generated by the MMSE criterion.", 
    "paper_subjects": [
        "Learning (cs.LG)", 
        "Sound (cs.SD)"
    ], 
    "paper_code": "1709.03658", 
    "paper_submission_date": "2017/09/12", 
    "paper_title": "End-to-End Waveform Utterance Enhancement for Direct Evaluation Metrics Optimization by Fully Convolutional Neural Networks"
}