{
    "paper_authors_list": [
        "Nguyen, Tu Dinh", 
        "Le, Trung", 
        "Vu, Hung", 
        "Phung, Dinh"
    ], 
    "paper_comments": null, 
    "paper_page_url": "https://arxiv.org/abs/1709.03831", 
    "paper_abstract": "We propose in this paper a novel approach to tackle the problem of mode\ncollapse encountered in generative adversarial network (GAN). Our idea is\nintuitive but proven to be very effective, especially in addressing some key\nlimitations of GAN. In essence, it combines the Kullback-Leibler (KL) and\nreverse KL divergences into a unified objective function, thus it exploits the\ncomplementary statistical properties from these divergences to effectively\ndiversify the estimated density in capturing multi-modes. We term our method\ndual discriminator generative adversarial nets (D2GAN) which, unlike GAN, has\ntwo discriminators; and together with a generator, it also has the analogy of a\nminimax game, wherein a discriminator rewards high scores for samples from data\ndistribution whilst another discriminator, conversely, favoring data from the\ngenerator, and the generator produces data to fool both two discriminators. We\ndevelop theoretical analysis to show that, given the maximal discriminators,\noptimizing the generator of D2GAN reduces to minimizing both KL and reverse KL\ndivergences between data distribution and the distribution induced from the\ndata generated by the generator, hence effectively avoiding the mode collapsing\nproblem. We conduct extensive experiments on synthetic and real-world\nlarge-scale datasets (MNIST, CIFAR-10, STL-10, ImageNet), where we have made\nour best effort to compare our D2GAN with the latest state-of-the-art GAN's\nvariants in comprehensive qualitative and quantitative evaluations. The\nexperimental results demonstrate the competitive and superior performance of\nour approach in generating good quality and diverse samples over baselines, and\nthe capability of our method to scale up to ImageNet database.", 
    "paper_subjects": [
        "Machine Learning (stat.ML)"
    ], 
    "paper_code": "1709.03831", 
    "paper_submission_date": "2017/09/12", 
    "paper_title": "Dual Discriminator Generative Adversarial Nets"
}